Revit 2027 API
ViewDisplaySketchyLines.EnableSketchyLines Property
 True to enable sketchy lines visibility. False to disable it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EnableSketchyLines { get; set; }
Public Property EnableSketchyLines As Boolean
	Get
	Set
public:
property bool EnableSketchyLines {
	bool get ();
	void set (bool value);
}
member EnableSketchyLines : bool with get, set
Property Value
Boolean
See Also
Reference
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace